fixtures/chargify/signup_success.json

{
  "event": "signup_success",
  "id": "5",
  "payload": {
    "subscription": {
      "cancellation_message": "",
      "customer": {
        "last_name": "Doe",
        "reference": "",
        "phone": "555-555-1234",
        "first_name": "John",
        "zip": "12345",
        "address_2": "Apt 123",
        "address": "123 Main St",
        "state": "NC",
        "updated_at": "2012-09-09 11:38:32 -0400",
        "created_at": "2012-09-09 11:38:32 -0400",
        "organization": "Acme, Inc.",
        "id": "15",
        "email": "john@example.com",
        "country": "US",
        "city": "Pleasantville"
      },
      "trial_started_at": "",
      "product": {
        "handle": "handle_6a9273b8a",
        "expiration_interval_unit": "never",
        "archived_at": "",
        "interval_unit": "month",
        "product_family": {
          "handle": "acme-online",
          "accounting_code": "",
          "name": "Acme Online",
          "id": "4",
          "description": ""
        },
        "accounting_code": "",
        "price_in_cents": "9900",
        "expiration_interval": "",
        "name": "Pro",
        "trial_interval_unit": "month",
        "interval": "1",
        "return_params": "",
        "updated_at": "2012-09-09 11:36:53 -0400",
        "created_at": "2012-09-06 10:09:35 -0400",
        "id": "23",
        "return_url": "",
        "trial_interval": "",
        "description": "Vel soluta nihil qui accusamus quidem.  Et qui qui et sit omnis sit.  Veritatis voluptates aut incidunt mollitia corporis labore accusantium.",
        "trial_price_in_cents": "",
        "update_return_url": "",
        "initial_charge_in_cents": "",
        "require_credit_card": "true",
        "request_credit_card": "true"
      },
      "trial_ended_at": "",
      "previous_state": "active",
      "expires_at": "",
      "coupon_code": "",
      "current_period_started_at": "2012-09-09 11:38:32 -0400",
      "canceled_at": "",
      "next_assessment_at": "2012-10-09 11:38:32 -0400",
      "credit_card": {
        "last_name": "Doe",
        "card_type": "bogus",
        "vault_token": "1",
        "first_name": "Jane",
        "billing_state": "NC",
        "masked_card_number": "XXXX-XXXX-XXXX-1",
        "expiration_year": "2016",
        "billing_country": "US",
        "customer_vault_token": "",
        "customer_id": "15",
        "billing_address": "987 Commerce St",
        "expiration_month": "4",
        "current_vault": "bogus",
        "billing_city": "Greenberg",
        "id": "14",
        "billing_address_2": "Suite 789",
        "billing_zip": "67890"
      },
      "signup_revenue": "99.00",
      "signup_payment_id": "30",
      "delayed_cancel_at": "",
      "state": "active",
      "cancel_at_end_of_period": "false",
      "updated_at": "2012-09-09 11:38:33 -0400",
      "created_at": "2012-09-09 11:38:32 -0400",
      "id": "14",
      "activated_at": "2012-09-09 11:38:33 -0400",
      "current_period_ends_at": "2012-10-09 11:38:32 -0400",
      "balance_in_cents": "9900",
      "total_revenue_in_cents": "4200"
    },
    "site": {
      "subdomain": "acme-test",
      "id": "3"
    }
  }
}
